[
  {
    "key": "1745857043462",
    "headline": "Memories of Berlin",
    "teaser": "I remember how cold it was...",
    "content": "There are many things that lay forgotten, like herbal teabags you never get around to drinking, as so it is with memories.From one day to the next you never give them a thought and then something triggers them and they come back in full color. And so it was in January 2025 with the election if Donald Trump to a second term that politics got interesting again. Some pundit remarked that for the first time in years the American public had been given a real choice, between left and right. Like many a modern democracy the choice had been between Coke or Pepsi taking turns. Now it was socialism and censorship or capitalism and free speech.\n<p> \nThis event coincided with the conviction of the mass murderer Axel Rudakubana, who had stabbed three small girls and killed them in Southport.\n<p> \nThe knives were also out for Kier Starmer who had become wildly unpopular for his handling of the whole shooting match. The looney left and the racist right. My memory of the time I saw the left and right in closeup.\n<p> \nSometime in the 80s, through a friend, I had wangled a trip to Berlin. This would have been few years prior to the fall of The Wall. There was still a smell of Len Dayton in the the air when I landed at Tegel airport. Bomb damage was still evident, and a large military presence loomed. Rudolf Hess was cooling his heels in Spandau prison, which was in a posh bit of Berlin.\n<p> \nTo paint a little background to my story I need to explain how things were in Berlin at the time. First to say that the Russians had won the war, with Americans and British Empire joint second and the French taking up the rear, so to speak. Germany was divided into the Bundes Republic in the west and the DDR in the east. Berlin was in the east and was accessible though a road corridor or by air.\n<p> \nThe allies shared the territory of Berlin which was split into four zones. American, British, Russian and French. No one could tell me why the French were there. Someone said they threatened to sulk if not and wanted to make it look like they had been in the war.\n<p> \nBerlin at the time was still under marshall law, although the Berlin police were still in business giving out traffic tickets and investigating disturbances among Germans, they had no power over the military , so nome Germans parked where they liked ( with reason) .\n<p> \nIt was far easier to visit as a member of the armed forces and so I took King’s Shilling, signed the Official Secrets Act and was given a little ID card. No uniform was offered so I could pretend to be a spy, maybe. I I was allowed into the NAFFI where the food was pretty awful, but the tea was OK, and the bar convivial.\n<p> \nBeing driven around West Berlin I was puzzled to see a large black car flying Soviet flags with important looking passengers. It was explained that this was a “flag tour” where the soviets showed their right to drive around West Berlin. This has been part of the Potsdam Treaty I was told.\n<p> \nCome Saturday I joined a tour bus of new arrivals and set off for a look at East Berlin. I remember having to change some Deutschmarks in Ost marks at one for one, which was a swizz as Deutschmarks were worth much more. I got to see the Escapees Museum at checkpoint Charlie, where you good see cars, aircraft and other smuggler stuff. Also stories of those killed trying to escape the soviet paradise.\n<p> \nAs I said, it was Saturday and West Berlin was in full shop, shop, shop, and busy. The East was like a tomb. Streets empty, buildings empty, bomb sites, and as West berlin had some post war real estate development, the East look well preserved from the pre war era. On the main drag, nothing. Then in the distance came the sound of an angry wasp which turned out to be a Trabant, a sort of Reliant Robbin, but no so reliable. This was a workers car that you had to wait years for. It came and went, then nothing. The occasional Russian Officer walked by in full uniform with a chest of medals. We spent our marks of a cup of undrinkable coffee and an inedible sausage.\n<p> \nThere was a clothes shop, but it only sold gloves ( rabbit skin ). I didn’t check mut I hope they were of mixed left and right? A grubby supermarket had a large line outside, then a coach drew up. They said they were from Poland on a shopping trip. There contrast East and West, was impressive.\n<p> \nI stayed maybe a week or so, then got DE mobbed, and returned home. It would be a few years before the wall was to come down, but we all knew which way the human tide would flow.\n<p> \n",
    "image": "Berlinermauer.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745856363426",
    "headline": "Let it Be a Cover",
    "teaser": "The Beatles we not the first",
    "content": "I think I have a pretty broad taste in music, I’ll give anything a shot, if it sounds nice then I don’t much care if it’s country, rock, pop, classical etc etc etc. It’s nice to have some music when relaxing in the house, or working on something boring. When anyone might enquire what sort of music I like, to avoid the cliche “everything”, I will say it’s covers. And indeed this is true. As I see it the advantage of a cover is that it you have a favorite piece of music that you’ve play to death and are getting a bit fed up, you may find a cover brings new life to your streaming collection. So before I continue I should define what is a cover. When an artist owns an original piece of music they have the right of first performance, which is logical because no one else knows about it. After the first significant public performance, or commercial release, the song comes up for grabs, and anyone can make a version and make money from it.\n\nSo what about all this “when X called Y to ask for permission to cover Z” type stories, this is a courtesy call it’s not required. When you do need leave it’s when you want to use it in another medium, like a jeans advert or a movie. The coverer is obliged to pay a royalty fee though an agency to the songs owner. Performing rights. Anyway, that’s the law as I think it is.\n\nIn general it seems to be opinion that the original is best, but of course there may be other opinions. One famous oft quoted is that Jimi Hendrix covered “All along the Watchtower”, by Bob Dylan, and many think Hendrix did a better version. It’s certainly different. Dylan was reported to say that he now plays it more like the Hendrix version.\n\n",
    "image": "Sgt._Pepper's_Lonely_Hearts_Club_Band (1).jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745798595974",
    "headline": "Why you can't tune a piano",
    "teaser": "In fact it's impossible, we just do our best",
    "content": "\n      Well, first off I have to admit that I can’t tune a piano. Number one obstacle being that I don’t own a piano, nor do I know anyone who does who would be foolish enough to let me try. Nor do I have the tools to do it, like a tuning fork, ( always something new to buy 😉 )\n      or that Allen key with a tommy bar on the top, plus all the felt needed to replace any that’s missing, or the little wooden hammers, or the glue. All could be remedied by a quick tap on Amazon, and a short wait.\n      <p>\n      More importantly, I don’t have the know how, or the skill to tune a piano.\n      When I was a lad, piano tuning was quite a thing, we were at the tail end of the piano revolution when the height of Victorian status was an upright in the parlor. ( snigger, cough, sorry ). You couldn’t find a piano tuner easy enough, unless you lived in the sticks, and our local man, just up the road was Mr. Wooten.<p> Now, Mr. Wooten was very old, and his wife not so much. I didn’t know much about him, except he was locally famous for something ( maybe he played back in the day ) before he went blind? Piano tuners were frequently blind people, or am I making that bit up? Anyway, thing was that Mrs. Wooten only had one hand. The other was a split hook that opened and closed, and it scared me, as she worked in the local shop and I had to go errands there.\n    <p>  \n      Well, Mr. Wooten arrived with his bag of tricks and gave our old Joanna a good servicing .. so to speak, as he couldn’t give her a “seeing to” , if you get my drift.\n     <p> \n      I watched him with interest, I remember. This was something you didn’t see every day. It seemed to take a long enough time, and I still have the distant memory, but to get back to the original question, the answer is that it’s impossible. To tune a piano.\n   <p>   \n      “Wait , wait ,wait”, I hear you cry, how come people are paying good money to someone to do the impossible, which would be a paradox anyway. If it’s just a matter of hitting the right frequency then surely there’s an app for that nowadays. And true enough. Although hitting the right frequency is not the problem. It’s that “yee canny change the laws of physics, Captain”, and this falls into the “stem subjects basket”.\n     <p> \n      I’ll now do my best to explain. ( Or go look on Wikipedia for yourself ).\n      <p>\n      Imagine a piece of string, or catgut, or wire or whatever. If you stretch it like in a guitar, violin, or piano, and pluck it, bow it, or hit it with a mallet, it will make a sound. This has been know for a few years now. Scientists believe its due to vibration of the string and indeed, harmonic motion is a well plowed row.\n <p>     \n      Now it you take a sting half as long it will vibrate at a frequency twice as high. That’s know as a octave, for reasons which are quite ironic, as you’ll see later.\n    <p>  \n      Humans, ( and many pets ) find this a pleasing harmonic as the notes don’t beat on again the other. If two notes are “out of tune”, it can sound quite awful and you can hear a “beat” depending on how they differ. That’s how Mr. Wooten would have found his first note, by striking a tuning fork and listening for the beats while tickling the Allen key to get the string to the right pitch. Armed with one correct note the octaves could be tuned with reference to that note, or by the fork. So far, so good.\n      <p>\n      Now let’s think about the circle of fifths. A perfect fifth from C gets you to G. And a perfect fifth sounds very nice, just tune away the beats and you get the perfect fifth. So now carry from G. The next up is D. G to D is a perfect fifth. D to A, and so on, A to E and so on and that will bring us back to Doe. Or should I say “Doh!:, because it doesn’t. It’s slightly out. So when you get back to C and test it against where you stated it’s not an exact number of octaves away.\n   <p>   \n      The piano will have been tuned in “just temperament”, and it should sound vey pleasing, except it will only play in the key of C. So if you don’t want more than one key signature, go for it. Problem comes when you play a duet with the person next door who has his or her instrument tuned in a different key.\n      <p>\n      In years back , like when people wore tall wigs, they would have a “box of viols” like little pianos tuned to different keys. Quite impractical.\n      \n      Someone, at some time, invented the piano, and with it “equal tempering”, which was a big thing. Bach even wrote a bit of music about it. The modern era began.\n      \n      So, what is a “well tempered clavier”?\n    <p>  \n      It’s a compromise , so that each note is a bit out making 12 equally spaced sounds, 11 of them a bit out. To get the frequency of the next note up, multiply the current note by the 12th root of 2 ( think about it ).\n      \n      I would have imagined Mr. Wooten would have used his skill and judgement to make the piano sound “sweet”, and indeed there were guidelines as to how to achieve this avoiding the “wolf frequencies”, so that there was even more of a compromise, the 12 keys would not be equally spaced, so that the “common keys” might sound sweeter.\n     <p> \n      A guitar player has a similar dilemma. So you may see them twigling the machine head for their next song to “drop the fifth” a shade to make the country music sound better. ( I actually do like a lot of country music , which drops my music cred like a hot brick).\n   <p>   \n      A violinist can laugh at them as the violin has no frets, and the player wobbles their left hand anyway.\n      \n      Brass instruments can be tuned, but valves give the piano problem, except the trombone, it has a slider.\n  <p>    \n      Electronic music can “do anything”, as can the human voice, which\n      is why a choir sounds so angelic.\n   <p>   \n      Now I’ve written enough, but there’s still a lot to say. Maybe in a future post.\n      Give this a viddy, then go tune something.",
    "image": "piano.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745800092442",
    "headline": "Conviction Politics",
    "teaser": "Honorable mentions",
    "content": " <div>\n    <img  src=\"images/parliament.jpg\" alt=\"Folks\" class=\"w3-left  w3-margin-right\"\n        style=\"width:150px\">\n</div>\n\n<div id=\"post-headline\">\n    Conviction Politicians\n</div>\n\n<div id=\"post-texting\">\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n        The only politicians worth their salt to me are what are called conviction politicians. Career politicians\n        really give\n        the word a bad name. people who see it as a duty and not a job so they can retire to consultant positions on\n        boards of\n        companies they helped along the way, or to the comfort of the vermin in the House of Lords. Sorry, I meant\n        to type\n        “ermine”. <br>\n\n\n        <table style=\"width:100%; float: left; margin-right: 15px;display:none\">\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>Margaret Thatcher Britain’s “Iron Lady” transformed the UK with free-market reforms and a\n                    bulldog refusal to\n                    compromise.\n                    Loved or loathed, she crushed unions and faced down the Soviets without blinking.</td>\n                    <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>Ron Paul\n                    A U.S. libertarian icon, he championed small government and individual liberty with unwavering\n                    consistency.\n                    Known for opposing the Federal Reserve and endless wars, he stuck to his guns no matter the\n                    crowd.</td>\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Javier Milei\n                    Argentina’s fiery libertarian president, championing free markets and limited government with a\n                    chainsaw-wielding zeal,\n                    reshaping the nation’s political landscape since 2023.</td>\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/ar.png\" alt=\"Argentine Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Ronald Reagan\n                    America’s sunny conservative redefined the GOP with tax cuts, deregulation, and Cold War\n                    bravado.\n                    His belief in freedom and a strong nation never wavered, even under fire.</td>\n                <td><img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Tony Benn\n                    A left-wing titan, he pushed democratic socialism and anti-imperialism to his last breath.\n                    Quit Parliament to “spend more time on politics”—and meant it.\n                    John Major\n                    A quiet Tory PM, he steered Britain through recession and Maastricht with steady conviction.\n                    No flash, just a belief in decency and pragmatism over populism.\n                </td>\n\n                <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Donald Trump\n                    A brash outsider, he stormed U.S. politics with promises of disruption and national pride.\n                    Love him or hate him, he stuck to his script, defying elites at every turn.</td>\n                <td><img src=\"https://flagpedia.net/data/flags/h80/us.png\" alt=\"USA Flag\" width=\"60\"></td>\n            </tr>\n            <tr>\n                <td>\n                    <img src=\"images/puppy.jpg\" width=\"150px\">\n                </td>\n                <td>\n                    Betty Boothroyd\n                    The first woman Speaker of the Commons, she ruled with fairness and a steel backbone.\n                    Party didn’t matter—she upheld Parliament’s dignity above all.\n                    I’m sure there are more, but these are the ones that came to mind..</td>\n                    <td> <img src=\"https://flagpedia.net/data/flags/h80/gb.png\" alt=\"UK Flag\" width=\"60\"></td>\n            </tr>\n\n        </table>\n\n\n \n\n</div>",
    "image": "lotofmen.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745856788798",
    "headline": "Other People's Names",
    "teaser": "As I was saying to my old friend Ivor Longcock....",
    "content": " \nThere a small book by Primo Levi that I’ve enjoyed dipping into now and then over the years. It’s called “Other People’s’ Trades”. I had almost forgotten it until I was scratching my head to think of a title for this post. It’s a collection of essays describing various jobs and trades. I must read it again soon.\n<p>  \nBack to the subject then. I’m fascinated by languages and the derivation of words, and so no surprised I’ve been wondering about names. Almost everyone has a name, or maybe two or three, and how we came by them is an interesting question.\nNow here I’m talking about surnames in particular, they must have an origin and maybe they evolve through time. I’ll confine this to English speaking names, but it would be useful to compare these to other cultures in the world.\n<p>  \nNow, let’s start with Smith.And why not. It has long been the most common name surname in English speaking countries. There people have a christian name or two and a surname, or maybe more than one if they are multi-barreled. Or should be say a given name and a forename, just to be more inclusive. So John Smith. Someone’s lacking in imagination, still have met quite a few John Smiths all look like you would expect a John Smith to look. So I guess years ago being a Smith was pretty big cheese what with all those horses to shoe. Taylor springs to mind ( John Also ), Sigourney Weaver , Max Miller, Ginger Baker, Butcher, Fletcher, Cooper ( made barrels ), Carpenter ( John again ) Thatcher ( you know who ) and Harry Potter. You could populate a village thus. Then we have people who have rich blood, King, Lord, Knight. But what about the Farmers?? So many of them. Mr Farmer??\n<p>  \nOn to colours. I’ve met a Mr Black and a Dr White. There’s and Earl Grey, a Huey Green, and many a Joe Brown. But where’s Mr Blue? Miss Yellow? Master Orange ( Take That! ). But like a set of Cluedo pieces.\n<p>  \nNow on to the sons. There are Johnsons, Petersons, Robertsons, Andersons, but no daughters. Explained by the patriarchy and the tradition of passing the family name down the male line.\n<p>  \nSometimes names are derived from towns ( Tony Blackburn ) or cities ( Michael York ) or even countries. Dawn French, Jules Holland,\n<p>  \nAnimals, apart from John Bull, James Whale, Michael Fish, and I did once know a guy called Rob Chicken.\n<p>  \n( You shouldn’t laugh ).\n<p>  \nWell, that’s about it.",
    "image": "download.jpeg",
    "date": "2025-04-28"
  },
  {
    "key": "1745857197549",
    "headline": "Computer Says \"No\"",
    "teaser": " Every programmer knows the feeling like they did everything right, and it was working...",
    "content": "Apart from the comic effect of the now well politically incorrect Little Britain, whilst recently trying to correct an issue I had with some company website, ( now fixed thanks ), I remember times in my Geekhood when it seemed impossible that the computer was right and I was wrong. Every programmer knows the feeling like they did everything right, and it was working a moment ago and it come up with what seems like a bug. You look at the code for the obvious errors, not there. You roll back a version, either that works for not, but as you put back the changes it still won’t work. After to some struggle you have to admin to defeat and ask the guy or gal in the next desk to take a look for you. Often as you explain the problem you talk yourself into the answer, or maybe your desk mate can say “oh they changed the compiler last week” , or “you’re running the old version, idiot!”. A fresh pair of eyes. Often where you are looking isn’t where you should look at all. But sometimes, just sometimes, you can’t crack the problem. Random errors are the worse. Works then doesn’t, then works again. There is a sort of rule of thumb.\n<p>\nBlame the user – usually yourself .\n<p> \nBlame the data – check the inputs and outputs, eyeball the data .\n<p> \nBlame your code.\n<p> \nBlame the library.\n<p> \nBlame the compiler – now I’ve seen this happen a couple of times. I was the guy in the next desk and I was shown some Cobol that should have worked but it threw an error at runtime. Now I don’t know how I knew this, maybe I read to many manuals, but I saw the subroutine was being call from an address which was not on a word boundary. An easy mistake to make, but hard to spot.\n<p> \nBlame the operating system. – maybe the disk is full, or there’s a known bug in windows, or a quirk in Chrome, these things happen, or a display driver, but not often.\n<p> \nBlame the hardware – You can check this by running on another machine.\n<p> \nThen you’re stumped.\n<p> \nI’ve only been stumped twice in my life. At a total loss. But hello, hang on, I don’t like to be beaten!\n<p> \nI don’t know if I came up with the answers probably not, but here are the situations.\n<p> \nA mini computer for a hotel accounts dept kept going wrong. Crashes, corrupt memory, random errors.\nThey changed the disks, Upgraded the OS. Still no fix. They manufacturer changed all the memory. Still no go. They changed the machine, still no go. They gave up and flew back to Texas.\n<p> \nI was a junior programmer and was sent to spend Christmas in a nice hotel in London so I could be a face to blame when it went wrong. It didn’t go wrong. Once. I went home, it went wrong again.\n<p> \nAnswer. The office was on the second floor. There was a butcher on the first floor with big meat cutting saws. Over Christmas he didn’t work. The computer did. The solution was to build a Faraday cage around the machine room. Solved.\n<p> \nSecond case. An international airport had a similar problem. Different computer company. Worked and then didn’t, but it always seemed to fail on Thursdays. Again environment. They had a training radar school on Thursdays. Easy fix. aluminum foil in the case ( so they told me ).\n<p> \nSo if you’re ever stumped take comfort in the fact that cosmic rays can knock electrons out of chips. This is rare, but with so many computers in the world, this just might be the excuse you’re looking for.",
    "image": "computer.png",
    "date": "2025-04-28"
  },
  {
    "key": "1745856563392",
    "headline": "The Albert Hall",
    "teaser": "What about the holes?",
    "content": "The Royal Albert Hall is in Kensington, London, England. There are many other Albert Halls in the UK, and around the world, as well as many people called Albert Hall famous enough to merit an entry in Wikipedia.\n<p> \nMost people will have heard the Beatles song “A Day in the Life” and smirked at the line “now you know how many holes it takes to fill the Albert Hall”, from memory it’s 10,000 in Blackburn, Lancashire.\nThe Albert Hall has thus been used as a unit of measure.\n<p> \nFor example, the Rock of Gibraltar is the biggest rock in the world.\n<p> \nTo determine how many Royal Albert Halls would fill the Rock of Gibraltar, we need to compare their volumes. The volume of the Royal Albert Hall is approximately 100,000 cubic meters.\n<p> \nThe Rock of Gibraltar has an estimated volume of about 4.5 million cubic meters. Here’s how we calculate:\n<p> \nVolume of the Rock of Gibraltar: approximately 4,500,000 cubic meters.\nVolume of one Royal Albert Hall: approximately 100,000 cubic meters.\n4,500,000 cubic meters100,000 cubic meters per Albert Hall=45\n<p> \nTherefore, approximately 45 Royal Albert Halls would fit within the volume of the Rock of Gibraltar.\n<p> \nA similar calculation tells us 5.64 million Royal Albert Halls could fit inside the volume of the Chicxulub meteor that finished off the dinosaurs.\n<p> \nBesides the Albert Hall and the London bus, i.e. “as\ntall as” and “laid end to end” several other informal units of measure have become popular, particularly in the UK and sometimes beyond. Here are a few:\n<p> \nFootball Pitches: Often used to describe large areas of land or the size of events. For example, “The festival covered an area the size of 10 football pitches.”\nOlympic Swimming Pools: Used to describe volumes of liquid or areas, especially in news reports about spills, water usage, or construction projects. An Olympic pool holds 2,500 cubic meters of water.\nWales: Frequently used to give a sense of scale for large areas or quantities, like “The new forest will be the size of Wales.” Wales is roughly 20,779 square kilometers.\nDouble-decker Buses: Similar to the London bus but can refer to any double-decker, used for both volume and area measurements, e.g., “The amount of waste produced could fill 50 double-decker buses.”\nWembley Stadium: Used for very large gatherings or constructions, “The concert attracted a crowd equivalent to filling Wembley Stadium twice.”\nCoins: Particularly British coins like the “pence piece” (e.g., “about the size of a 50 pence piece” for small dimensions).\nGrains of Sand: About the size of a grain of sand, Also pin heads seemed to be popular in the middle ages as people struggled to calculate the sizes of dancing angels.\n",
    "image": "Sgt._Pepper's_Lonely_Hearts_Club_Band.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745851639336",
    "headline": "Huevos Motuleños",
    "teaser": "Only from Motul",
    "content": "<div  class=\"w3-sans-serif\" style=\"font-size:18px\">\n\n\nAny time we are passing Motul in the morning we almost always fail to pass it and instead turn off the carretera and go into the town. Motul is a fair sized small market town of 34,000 or so souls and worth a stop for its market, church, San Juan Bautist, and a small cenote on the edge of town. Apart from that though it’s the home of the famous dish eggs Motuleños, and the gold standard is to go to the food hall above the municipal market 20th November and head to concina Doña Evelia. I have no idea if the lady is still there, but the place is always packed when I go, and we have to wait 10 minutes or so for a table. I’d estimate there are maybe 200 chairs, so it must be doing good business. I don’t think there any choice other than “how many eggs?” and “how do want them cooked?”. So if you don’t like Motuleños don’t bother going.\n\nThe version there is what I would say is the basic reference. I’ve not actually watched the preparation close up, but from the taste and making them myself at home I can say it contains the following.\n\nTostadas with black beans spread on top.\nTomatoes fried with onions and garlic, plus a charred and stewed chile habanero.\nTinned processed peas,\nFried platano macho.\nFried eggs\nCilantro\nsalt.\n\nOn this basis, at home, I may add chopped ham, and grated cheese, depending how I feel.\n\nThe dish is available most restaurants in Yucatan can whip one up and it’s usually very good.\nIn Mérida I like Puruxón Cauich in Francisco Montejo.They do a few variations, but I alwasy get\nMotuleños divorciados, green and red tomatoes.\n\nThere’s also a branch in Copules but it’s not so good as the Francisco Montejo one..\n\n </div>",
    "image": "blogging.jpg",
    "date": "2025-04-28"
  },
  {
    "key": "1745847080441",
    "headline": "The Wind",
    "teaser": "May as well try to catch it",
    "content": "<div id=\"div1\">\n    <div>\n        <img id=\"post-image\" src=\"images/donavan.jpg\" alt=\"Donovan\" class=\"w3-left  w3-margin-right\"\n            style=\"width:150px\">\n    </div>\n    <div id=\"post-headline\">\n        Try to Catch The Wind\n    </div>\n\n    <div id=\"post-text\">\n\n\n<p>No, nothing to do with eating Brussel sprouts. I was provoked this morning by reading about upcoming developments in Coplot AI inside GitHub ( Microsoft ), which would seem a natural match. I made me think how far we have come in my memory, and speculate where we will go to next. A.I. has moved so quicky that to me, just as I start to grok it, it morphs into something else, like the hydra, but maybe in a good way.</p>\n<p>My first program was written in Secondary school in Mr. Copley&#8217;s class. Mr. Copley was famous for his R.E. classes so it was a little strange that he should pop up in the maths department. I had already learned some things from the Open University TV about Boolean logic, analogue v digital, simple programing languages like Basic and Algol, but I was yet to get the baptism of running my first program.</p>\n\n\n\n<p>The teacher give us the basic outline, and demonstrated how Fortran did its thing with some examples. Then we were told to get out our notebooks and write a simple program. Next lesson, we got some punch cards and a magnetic pencil and converted each symbol into three marks in every column. This was sent away somewhere and returned together with a printout of the code. \n    I don&#8217;t remember a hand punch entering the loop anywhere. Long story short I eventually got the output from my program. For the record it was calculating various scenarios or the taps and baths problem. It worked!</p>\n\n\n\n<p>There I left it, through 6th form nothing. University, nothing. Post Grad, back to Fortran,\n     a bit of PDP assembler, and some interactive Basic. Never saw a graphic terminal\n      till someone in a lab acquired a Commadore Pet. It played poker.</p>\n\n\n\n<p>Eventually I got a job and became a Junior Programmer. 25 or so years in the industry, partly as a\n     contractor, I was able see how it evolved from close up. The PC was a new thing, which I didn&#8217;t \n     acquire from many years, but I saw technologies, languages, paradigms come and go. languages included, Cobol, Dibol, Fortran, C, C++,Basic and a few odd balls. I loved it. I would make sure to get my copy of Byte every month, got an AOL account. The days of buying a book, or a bit of software then emailing the author and expecting a reply.</p>\n\n\n\n<p>Now for A.I. It seemed at first to be something I didn&#8217;t understand that \n    people used to make funny photos and present them to you. It was quite a buzz, and the the rise of the chatbots whether the proverbial Mother or Grandmother is using Chat GPT on a regular basis, I think not.</p>\n\n\n\n<p>The news today enthusing about what the beta versions of the GitHub,\n     Copilot team could do left me a bit stunned.</p>\n\n\n\n<p>Over to Grok.</p>\n\n\n\n<p class=\"has-small-font-size\">GitHub is home to over 420 million repositories as of late 2024, hosting code\n     written by more than 150 million users. These repositories contain an immense volume of code across countless\n      programming languages, frameworks, and projects. While GitHub doesn’t publicly disclose the exact number of lines of code stored on its platform, we can make an educated guess based on available data and trends.</p>\n\n\n\n<p class=\"has-small-font-size\">A single moderately sized repository might contain anywhere\n     from a few thousand to tens of thousands of lines of code, while large projects—like open-source \n     frameworks or enterprise software—can easily exceed millions of lines. For instance, the Linux kernel \n     alone has over 30 million lines of code. If we conservatively assume an average of 10,000 lines per \n     repository (accounting for both small scripts and larger projects), multiplying that by 420 million \n     repositories gives us a rough estimate of 4.2 trillion lines of code on GitHub. This is likely an \n     underestimate, as many repositories are far larger, and GitHub’s growth continues to accelerate.</p>\n\n\n\n<p class=\"has-small-font-size\">Copilot, however, wasn’t trained on every single line of code in every GitHub repository.\n     It was developed using a subset of publicly available code, filtered and processed by OpenAI to create its underlying model,\n      Codex. This training data includes billions of lines of code from public GitHub repositories, though the exact \n      figure isn’t disclosed. Research and industry reports suggest that large language models like Codex are trained on datasets\n       containing tens to hundreds of billions of lines of code, drawn not just from GitHub but also from other public sources\n        like Stack Overflow and open-source archives. Given GitHub’s dominance as the largest code hosting platform, it’s \n        reasonable to estimate that Copilot’s training data includes at least 50 to 100 billion lines of code from GitHub alone.</p>\n\n\n\n<p>Back to me. Seems that Copilot and GitHub could be used to maybe develop improved AI models, or at least \n    improve the GitHub codebase in general. This is synergistic so this feels like a hockey stick moment in time.\n     The singularity is near, or maybe it&#8217;s already here.</p>\n\n\n\n<p>I'll leave you with a song.</p>\n \n    </div>\n</div>",
    "image": "donavan.jpg",
    "date": "2025-04-28"
  }
]